{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|bos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|eos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<|bos|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<|eos|>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<|bos|>": {
        "id": "<|bos|>",
        "ids": [
          0
        ],
        "tokens": [
          "<|bos|>"
        ]
      },
      "<|eos|>": {
        "id": "<|eos|>",
        "ids": [
          1
        ],
        "tokens": [
          "<|eos|>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|bos|>": 0,
      "<|eos|>": 1,
      "(": 2,
      ")": 3,
      "*": 4,
      "+": 5,
      "a": 6,
      "c": 7,
      "d": 8,
      "e": 9,
      "f": 10,
      "h": 11,
      "i": 12,
      "l": 13,
      "n": 14,
      "o": 15,
      "s": 16,
      "t": 17,
      "v": 18,
      "nd": 19,
      "co": 20,
      "cond": 21,
      "al": 22,
      "val": 23,
      "if": 24,
      "en": 25,
      "hen": 26,
      "then": 27,
      "no": 28,
      "not": 29,
      "and": 30,
      "el": 31,
      "se": 32,
      "else": 33
    },
    "merges": [
      [
        "n",
        "d"
      ],
      [
        "c",
        "o"
      ],
      [
        "co",
        "nd"
      ],
      [
        "a",
        "l"
      ],
      [
        "v",
        "al"
      ],
      [
        "i",
        "f"
      ],
      [
        "e",
        "n"
      ],
      [
        "h",
        "en"
      ],
      [
        "t",
        "hen"
      ],
      [
        "n",
        "o"
      ],
      [
        "no",
        "t"
      ],
      [
        "a",
        "nd"
      ],
      [
        "e",
        "l"
      ],
      [
        "s",
        "e"
      ],
      [
        "el",
        "se"
      ]
    ]
  }
}