{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<|bos|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<|eos|>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<|bos|>": {
        "id": "<|bos|>",
        "ids": [
          0
        ],
        "tokens": [
          "<|bos|>"
        ]
      },
      "<|eos|>": {
        "id": "<|eos|>",
        "ids": [
          1
        ],
        "tokens": [
          "<|eos|>"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "<|bos|>": 0,
      "<|eos|>": 1,
      "action": 2,
      "and": 3,
      "cond": 4,
      "do": 5,
      "else": 6,
      "if": 7,
      "not": 8,
      "t": 9,
      "then": 10,
      "while": 11,
      "z": 12
    },
    "unk_token": "<unk>"
  }
}